const path = require ('path')

module.exports = {

////////////////////////////////////////////////////////////////////////////////

get_xsd_path_of_r_o_g_d_i_n_f:

    function () {

		return path.join (__dirname, '..', 'Static/zags-rogdinf-ru-root.xsd')

    },

////////////////////////////////////////////////////////////////////////////////

get_request_of_r_o_g_d_i_n_f:

    function () {

		return this.rq.data
    	
    },

////////////////////////////////////////////////////////////////////////////////

get_response_of_r_o_g_d_i_n_f:

    function () {
/*    
    	const {rq: {data}} = this
*/
    	return {
  "ROGDINFResponse": {
    "ИдЗапрос": "0bde2079-eded-11ea-952d-00155d01aa22",
    "ДатаСвед": "1957-08-13",
    "КолДок": "1",
    "ТипАГСЗапрос": "01",
    "СведОтветАГС": {
      "ИдДок": "0bde2079-eded-11ea-952d-00155d01aa21",
      "РезОбраб": "1",
      "СведРегРожд": {
        "РазделЕГР": "1",
        "НомерЗаписЕГР": "110109060000401234123",
        "НомАГССвид": "1234",
        "НомерВерс": "0",
        "ДатаВерс": "2010-08-13",
        "КодСостСтат": "0101",
        "ДатаЗапис": "2010-08-13",
        "ОрганЗАГС": {
          "НаимЗАГС": "Отдел Государственной службы записи актов гражданского состояния Республики Ингушетия Джейрахского района",
          "КодЗАГС": "R0600004"
        },
        "СвидетРожд": {
          "ТипСвидет": "1",
          "СерияСвидет": "XII-АА",
          "НомерСвидет": "456321",
          "ДатаВыдСвидет": "2010-08-13"
        },
        "ПрдСведРег": {
          "ПрСчетМатер": "1",
          "СведРоды": {
            "ЧислоРодДетей": "1",
            "ПрСчет": "1"
          },
          "СведРодившемся": {
            "ЖивМертв": "1",
            "Пол": "1",
            "ФИОРожд": {
              "Фамилия": "Иванов",
              "Имя": "Иван",
              "Отчество": "Иванович"
            },
            "ДатаРождКаленд": "2010-08-10",
            "МестоРожден": {
              "ПризнМесто": "1",
              "МестоТекст": "Российская Федерация, Тюменская область, г. Тюмень",
              "КодСтраны": "643",
              "НаимСтраны": "Российская Федерация",
              "Регион": "72",
              "НаимСубъект": "Тюменская область",
              "Город": "г. Тюмень",
              "ОКТМО": "71701000"
            }
          },
          "СведМать": {
            "ГраждОКСМ": "643",
            "ФИО": {
              "Фамилия": "Иванова",
              "Имя": "Мария",
              "Отчество": "Петровна"
            },
            "ДатаРождКаленд": "1993-03-06",
            "МестоРожден": {
              "ПризнМесто": "1",
              "МестоТекст": "Российская Федерация, Тюменская область, г. Тюмень",
              "КодСтраны": "643",
              "НаимСтраны": "Российская Федерация",
              "Регион": "72",
              "НаимСубъект": "Тюменская область",
              "Город": "г. Тюмень",
              "ОКТМО": "71701000"
            },
            "УдЛичнФЛ": {
              "КодВидДок": "21",
              "СерДок": "2134",
              "НомДок": "123564",
              "ДатаДокКаленд": "2007-04-12",
              "ВыдДок": "Отдел УФМС России по Тюменской области в Центральном административном округе города Тюмени",
              "ПрКодВыдДок": "1"
            },
            "АдрМЖ": {
              "АдрМЖРФ": {
                "АдрРФФИАС": {
                  "АдрТекст": "Российская Федерация, Тюменская область, г. Тюмень, ул. Николая Федорова, д.17, кв.309",
                  "ИдНом": "6ce4f31e-2f77-427a-8a50-5c2175ba0cc0",
                  "ОКТМО": "71701000",
                  "Индекс": "000000",
                  "КодРегион": "72",
                  "НаимРегион": "Тюменская область",
                  "Город": "Тюмень",
                  "Улица": "ул Николая Федорова",
                  "Дом": "17",
                  "Кварт": "309"
                }
              }
            }
          },
          "ПрОтец": "1",
          "ПрСведДокОснОтец": "1",
          "СведДокРод": {
            "КодДок": "11023",
            "СерНомДок": "12365321",
            "ДатаДокКаленд": "2010-08-11",
            "НаимОрг": "ГБУЗ ТО Родильный дом № 2"
          }
        }
      }
    }
  }}
},
        
}